# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input('Введите число: '))
sum = 0
while n > 0:
    i = n % 10
    sum += i
    n = n // 10
print(sum)